joy-workday-integration-core/Get_Candidate_By_Email_Request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:Username>ISU_UST@ust_dpt1</wsse:Username>
                <wsse:Password>Ust1234567!</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <wd:Get_Candidates_Request xmlns:wd="urn:com.workday/bsvc" wd:version="v40.0">
            <wd:Request_Criteria>
                <wd:Candidate_Email_Address>david.delgado@workday.net</wd:Candidate_Email_Address>
            </wd:Request_Criteria>
        </wd:Get_Candidates_Request>
    </soap:Body>
</soap:Envelope>